app/controllers/admin_controller.rb

SELECT COUNT(*) FROM `usagerecords`
---
  def index
    @total_usagerecords = Usagerecord.count