app/controllers/events_controller.rb

  def show
    @event = Event.find(params[:id])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

  def edit
    @event = Event.find(params[:id])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

  def create
    logger.debug "Action Create im Controller ausgeführt"
    @event = Event.new(params[:event])
    logger.debug "Event mit folgenden Params angelegt: " + params[:event].to_s

    respond_to do |format|
      if @event.save
---
INSERT INTO `events` (`created_at`, `time`, `title`, `updated_at`) VALUES ('2012-01-11 20:21:48', '2012-03-11 20:21:00', 'Ein neuer Event', '2012-01-11 20:21:48')

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
UPDATE `events` SET `title` = 'wow ', `time` = '2012-02-11 20:21:00', `updated_at` = '2012-01-11 21:39:41' WHERE `events`.`id` = 1

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 3 LIMIT 1
DELETE FROM `events` WHERE `events`.`id` = 3