app/controllers/frontends_controller.rb

  def index
    @browser_charts = Usagerecord.select("browser, count(id) as requests" ).group("browser")
---
SELECT browser, count(id) as requests FROM `usagerecords` GROUP BY browser