app/controllers/homepages_controller.rb

SELECT `homepages`.* FROM `homepages`
---
  def index
    @homepages = Homepage.all

SELECT `homepages`.* FROM `homepages` WHERE `homepages`.`id` = 1 LIMIT 1
---
  def show
    @homepage = Homepage.find(params[:id])

SELECT `homepages`.* FROM `homepages` WHERE `homepages`.`id` = 3 LIMIT 1
---
  def edit
    @homepage = Homepage.find(params[:id])

INSERT INTO `homepages` (`beschreibung`, `created_at`, `name`, `updated_at`, `url`) VALUES ('das Wiki der MF', '2012-01-15 22:09:09', 'Wiki MF', '2012-01-15 22:09:09', 'mfwiki')
---
  def create
    @homepage = Homepage.new(params[:homepage])

    respond_to do |format|
      if @homepage.save

SELECT `homepages`.* FROM `homepages` WHERE `homepages`.`id` = 3 LIMIT 1
UPDATE `homepages` SET `url` = 'wikipedia.de', `name` = 'Die Wikipedia', `beschreibung` = 'Enzyklopädie', `updated_at` = '2012-01-19 23:15:04' WHERE `homepages`.`id` = 3
---
  def update
    @homepage = Homepage.find(params[:id])

    respond_to do |format|
      if @homepage.update_attributes(params[:homepage])