app/controllers/pages_controller.rb

SELECT homepage, count(id) as requests FROM `usagerecords` GROUP BY homepage
---
  def index
    @page_charts = Usagerecord.select("homepage, count(id) as requests" ).group("homepage")