app/controllers/resolutions_controller.rb

  def index
    @resolution_charts = Usagerecord.select("resolution, count(id) as requests" ).group("resolution")
---
SELECT resolution, count(id) as requests FROM `usagerecords` GROUP BY resolution