app/controllers/timelines_controller.rb

SELECT DATE_FORMAT(timestamp, '%d-%m-%Y') as datum, count(id) as requests FROM `usagerecords` GROUP BY datum
---
  def index
    @timeline_charts = Usagerecord.select("DATE_FORMAT(timestamp, '%d.%m.%Y') as datum, count(id) as requests" ).group("datum")