app/controllers/usagerecords_controller.rb

  def index
    @usagerecords = Usagerecord.all
---
SELECT `usagerecords`.* FROM `usagerecords`

  def show
    @usagerecord = Usagerecord.find(params[:id])
---
SELECT `usagerecords`.* FROM `usagerecords` WHERE `usagerecords`.`id` = 1 LIMIT 1

  def edit
    @usagerecord = Usagerecord.find(params[:id])
---
SELECT `usagerecords`.* FROM `usagerecords` WHERE `usagerecords`.`id` = 3 LIMIT 1

  def create
    @usagerecord = Usagerecord.new(params[:usagerecord])

    respond_to do |format|
      if @usagerecord.save
---
INSERT INTO `usagerecords` (`browser`, `created_at`, `fk_idHomepage`, `homepage`, `homepage_id`, `language`, `resolution`, `timestamp`, `updated_at`) VALUES ('Google Chrome', '2012-02-26 22:36:40', NULL, 'http://localhost:3000/webcalls/', NULL, 'de', '1080x1920', '2012-02-26 22:36:39', '2012-02-26 22:36:40')

  def destroy
    @usagerecord = Usagerecord.find(params[:id])
    @usagerecord.destroy
---
SELECT `usagerecords`.* FROM `usagerecords` WHERE `usagerecords`.`id` = 3 LIMIT 1
DELETE FROM `usagerecords` WHERE `usagerecords`.`id` = 3