app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY name
---
  def index
    @users = User.order(:name)

INSERT INTO `users` (`created_at`, `name`, `password_digest`, `updated_at`) VALUES ('2012-05-20 22:28:41', 'Heinz', '$2a$10$WF0zGR3hwFfTWRFt2jD.hOjf3O3aDJiWE81NuLsu8ff7mowbK/D6i', '2012-05-20 22:28:41')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy